In [14]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [15]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [16]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

**ADD DUMMIES FOR SEX COLUMNS:**

In [17]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [18]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [24]:
inputs.drop(['Sex'], axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

**FIND ANY Na NUMBER:**

In [25]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [26]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [27]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [28]:
from sklearn.model_selection import train_test_split

In [29]:
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size=0.3)

In [31]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [32]:
model.fit(x_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [33]:
model.score(x_test, y_test)

0.8134328358208955

In [34]:
x_test[:10]

     Pclass        Age      Fare  female  male
373       1  22.000000  135.6333       0     1
113       3  20.000000    9.8250       1     0
232       2  59.000000   13.5000       0     1
114       3  17.000000   14.4583       1     0
832       3  29.699118    7.2292       0     1
125       3  12.000000   11.2417       0     1
395       3  22.000000    7.7958       0     1
591       1  52.000000   78.2667       1     0
287       3  22.000000    7.8958       0     1
209       1  40.000000   31.0000       0     1

In [35]:
y_test[:10]

373    0
113    0
232    0
114    0
832    0
125    1
395    0
591    1
287    0
209    1
Name: Survived, dtype: int64

In [36]:
model.predict_proba(x_test[:10])

array([[0.02606887, 0.97393113],
       [0.07069378, 0.92930622],
       [0.97117831, 0.02882169],
       [0.06718297, 0.93281703],
       [0.98776294, 0.01223706],
       [0.9829871 , 0.0170129 ],
       [0.98629619, 0.01370381],
       [0.00204533, 0.99795467],
       [0.98630416, 0.01369584],
       [0.89298944, 0.10701056]])